IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_cmpss_lite_regs.xml
<module id="CMPSS_LITE_REGS" HW_revision="" description="CMPSS LITE Registers">
	<register id="COMPCTL" width="16" page="1" offset="0x0" internal="0" description="CMPSS Comparator Control Register">
		<bitfield id="COMPHSOURCE" description="High Comparator Source Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMPHINV" description="High Comparator Invert Select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CTRIPHSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CTRIPOUTHSEL" description="High Comparator Trip Output Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="ASYNCHEN" description="High Comparator Asynchronous Path Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMPLSOURCE" description="Low Comparator Source Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COMPLINV" description="Low Comparator Invert Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CTRIPLSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="CTRIPOUTLSEL" description="Low Comparator Trip Output Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="ASYNCLEN" description="Low Comparator Asynchronous Path Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="COMPDACE" description="Comparator/DAC Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="COMPHYSCTL" width="16" page="1" offset="0x1" internal="0" description="CMPSS Comparator Hysteresis Control Register">
		<bitfield id="COMPHYS" description="Comparator Hysteresis Trim" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="COMPSTS" width="16" page="1" offset="0x2" internal="0" description="CMPSS Comparator Status Register">
		<bitfield id="COMPHSTS" description="High Comparator Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="COMPHLATCH" description="High Comparator Latched Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="COMPLSTS" description="Low Comparator Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="COMPLLATCH" description="Low Comparator Latched Status" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="COMPSTSCLR" width="16" page="1" offset="0x3" internal="0" description="CMPSS Comparator Status Clear Register">
		<bitfield id="HLATCHCLR" description="High Comparator Latched Status Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HSYNCCLREN" description="High Comparator EPWMSYNCPER Clear Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LLATCHCLR" description="Low Comparator Latched Status Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="LSYNCCLREN" description="Low Comparator EPWMSYNCPER Clear Enable" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="COMPDACHCTL" width="16" page="1" offset="0x4" internal="0" description="CMPSS High DAC Control Register">
		<bitfield id="RAMPSOURCE" description="Ramp Generator Source Control" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="SWLOADSEL" description="Software Load Select" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="BLANKSOURCE" description="EPWMBLANK Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="BLANKEN" description="EPWMBLANK Enable" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="DACHVALS" width="16" page="1" offset="0x6" internal="0" description="CMPSS High DAC Value Shadow Register">
		<bitfield id="DACVAL" description="DAC Value Control" begin="11" end="0" width="12" rwaccess="RW"/>
	</register>
	<register id="DACHVALA" width="16" page="1" offset="0x7" internal="0" description="CMPSS High DAC Value Active Register">
		<bitfield id="DACVAL" description="DAC Value Control" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="DACLVALS" width="16" page="1" offset="0x12" internal="0" description="CMPSS Low DAC Value Shadow Register">
		<bitfield id="DACVAL" description="DAC Value Control" begin="11" end="0" width="12" rwaccess="RW"/>
	</register>
	<register id="DACLVALA" width="16" page="1" offset="0x13" internal="0" description="CMPSS Low DAC Value Active Register">
		<bitfield id="DACVAL" description="DAC Value Control" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="CTRIPLFILCTL" width="16" page="1" offset="0x16" internal="0" description="CTRIPL Filter Control Register">
		<bitfield id="FILTINSEL" description="Filter Input Select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CTRIPLFILCLKCTL" width="16" page="1" offset="0x17" internal="0" description="CTRIPL Filter Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CTRIPHFILCTL" width="16" page="1" offset="0x18" internal="0" description="CTRIPH Filter Control Register">
		<bitfield id="FILTINSEL" description="Filter Input Select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CTRIPHFILCLKCTL" width="16" page="1" offset="0x19" internal="0" description="CTRIPH Filter Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="COMPLOCK" width="16" page="1" offset="0x1a" internal="0" description="CMPSS Lock Register">
		<bitfield id="COMPCTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMPHYSCTL" description="COMPHYSCTL Lock" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DACCTL" description="DACCTL Lock" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CTRIP" description="CTRIP Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="COMPDACLCTL" width="16" page="1" offset="0x24" internal="0" description="CMPSS Low DAC Control Register">
		<bitfield id="RAMPSOURCE" description="Ramp Generator Source Control" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="BLANKSOURCE" description="EPWMBLANK Source Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="BLANKEN" description="EPWMBLANK Enable" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="CTRIPLFILCLKCTL2" width="16" page="1" offset="0x37" internal="0" description="CTRIPL Filter Clock Control Register 2">
		<bitfield id="CLKPRESCALEU" description="Sample Clock Prescale Upper Bits" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="CTRIPHFILCLKCTL2" width="16" page="1" offset="0x39" internal="0" description="CTRIPH Filter Clock Control Register 2">
		<bitfield id="CLKPRESCALEU" description="Sample Clock Prescale Upper Bits" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
</module>
